espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_ccfg.h
/******************************************************************************
*  Filename:       hw_ccfg_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CCFG_H__
#define __HW_CCFG_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CCFG component
//
//*****************************************************************************
// CCFG Size and Disable Flags
#define CCFG_O_SIZE_AND_DIS_FLAGS                                   0x00000000

// Mode Configuration 0
#define CCFG_O_MODE_CONF                                            0x00000004

// Mode Configuration 1
#define CCFG_O_MODE_CONF_1                                          0x00000008

// Voltage Load 0
#define CCFG_O_VOLT_LOAD_0                                          0x0000000C

// Voltage Load 1
#define CCFG_O_VOLT_LOAD_1                                          0x00000010

// Extern LF clock configuration
#define CCFG_O_EXT_LF_CLK                                           0x00000014

// IEEE MAC Address 0
#define CCFG_O_IEEE_MAC_0                                           0x00000018

// IEEE MAC Address 1
#define CCFG_O_IEEE_MAC_1                                           0x0000001C

// IEEE BLE Address 0
#define CCFG_O_IEEE_BLE_0                                           0x00000020

// IEEE BLE Address 1
#define CCFG_O_IEEE_BLE_1                                           0x00000024

// Bootloader Configuration
#define CCFG_O_BL_CONFIG                                            0x00000028

// Erase Configuration
#define CCFG_O_ERASE_CONF                                           0x0000002C

// Erase Configuration 1
#define CCFG_O_ERASE_CONF_1                                         0x00000030

// TI Options
#define CCFG_O_CCFG_TI_OPTIONS                                      0x00000034

// Test Access Points Enable 0
#define CCFG_O_CCFG_TAP_DAP_0                                       0x00000038

// Test Access Points Enable 1
#define CCFG_O_CCFG_TAP_DAP_1                                       0x0000003C

// Image Valid
#define CCFG_O_IMAGE_VALID_CONF                                     0x00000040

// Protect Sectors 0-31
#define CCFG_O_CCFG_WEPROT_31_0_BY2K                                0x00000044

// Spare register for WriteErase configuration
#define CCFG_O_CCFG_WEPROT_SPARE_1                                  0x00000048

// Spare register for WriteErase configuration
#define CCFG_O_CCFG_WEPROT_SPARE_2                                  0x0000004C

// Spare register for WriteErase configuration
#define CCFG_O_CCFG_WEPROT_SPARE_3                                  0x00000050

// Trustzone configuration register for flash
#define CCFG_O_TRUSTZONE_FLASH_CFG                                  0x00000054

// Trustzone configuration register for MCU SRAM
#define CCFG_O_TRUSTZONE_SRAM_CFG                                   0x00000058

// Configuration register for MCU SRAM
#define CCFG_O_SRAM_CFG                                             0x0000005C

// Configuration register for MCU CPU lock options
#define CCFG_O_CPU_LOCK_CFG                                         0x00000064

// Configuration register for debug authentication
#define CCFG_O_DEB_AUTH_CFG                                         0x00000068

//*****************************************************************************
//
// Register: CCFG_O_SIZE_AND_DIS_FLAGS
//
//*****************************************************************************
// Field: [31:16] SIZE_OF_CCFG
//
// Total size of CCFG in bytes.
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_W                              16
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_M                      0xFFFF0000
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_S                              16

// Field:  [15:4] DISABLE_FLAGS
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_W                             12
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_M                     0x0000FFF0
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_S                              4

// Field:     [3] DIS_TCXO
//
// Deprecated. Must be set to 1.
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO                            0x00000008
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO_BITN                                3
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO_M                          0x00000008
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO_S                                   3

// Field:     [2] DIS_GPRAM
//
// Disable GPRAM (or use the 8K VIMS RAM as CACHE RAM).
// 0: GPRAM is enabled and hence CACHE disabled.
// 1: GPRAM is disabled and instead CACHE is enabled (default).
// Notes:
// - Disabling CACHE will reduce CPU execution speed (up to 60%).
// - GPRAM is 8 K-bytes in size and located at 0x11000000-0x11001FFF if
// enabled.
// See:
// VIMS:CTL.MODE
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM                           0x00000004
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM_BITN                               2
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM_M                         0x00000004
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM_S                                  2

