espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_ccfg.h
// Field:    [28] WEPROT_SEC_28_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_28_N                  0x10000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_28_N_BITN                     28
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_28_N_M                0x10000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_28_N_S                        28

// Field:    [27] WEPROT_SEC_27_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_27_N                  0x08000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_27_N_BITN                     27
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_27_N_M                0x08000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_27_N_S                        27

// Field:    [26] WEPROT_SEC_26_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_26_N                  0x04000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_26_N_BITN                     26
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_26_N_M                0x04000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_26_N_S                        26

// Field:    [25] WEPROT_SEC_25_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_25_N                  0x02000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_25_N_BITN                     25
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_25_N_M                0x02000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_25_N_S                        25

// Field:    [24] WEPROT_SEC_24_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_24_N                  0x01000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_24_N_BITN                     24
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_24_N_M                0x01000000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_24_N_S                        24

// Field:    [23] WEPROT_SEC_23_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_23_N                  0x00800000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_23_N_BITN                     23
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_23_N_M                0x00800000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_23_N_S                        23

// Field:    [22] WEPROT_SEC_22_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_22_N                  0x00400000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_22_N_BITN                     22
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_22_N_M                0x00400000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_22_N_S                        22

// Field:    [21] WEPROT_SEC_21_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_21_N                  0x00200000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_21_N_BITN                     21
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_21_N_M                0x00200000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_21_N_S                        21

// Field:    [20] WEPROT_SEC_20_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_20_N                  0x00100000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_20_N_BITN                     20
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_20_N_M                0x00100000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_20_N_S                        20

// Field:    [19] WEPROT_SEC_19_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_19_N                  0x00080000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_19_N_BITN                     19
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_19_N_M                0x00080000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_19_N_S                        19

// Field:    [18] WEPROT_SEC_18_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_18_N                  0x00040000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_18_N_BITN                     18
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_18_N_M                0x00040000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_18_N_S                        18

// Field:    [17] WEPROT_SEC_17_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_17_N                  0x00020000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_17_N_BITN                     17
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_17_N_M                0x00020000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_17_N_S                        17

// Field:    [16] WEPROT_SEC_16_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_16_N                  0x00010000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_16_N_BITN                     16
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_16_N_M                0x00010000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_16_N_S                        16

// Field:    [15] WEPROT_SEC_15_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_15_N                  0x00008000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_15_N_BITN                     15
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_15_N_M                0x00008000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_15_N_S                        15

// Field:    [14] WEPROT_SEC_14_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_14_N                  0x00004000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_14_N_BITN                     14
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_14_N_M                0x00004000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_14_N_S                        14

// Field:    [13] WEPROT_SEC_13_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_13_N                  0x00002000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_13_N_BITN                     13
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_13_N_M                0x00002000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_13_N_S                        13

// Field:    [12] WEPROT_SEC_12_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_12_N                  0x00001000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_12_N_BITN                     12
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_12_N_M                0x00001000
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_12_N_S                        12

// Field:    [11] WEPROT_SEC_11_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_11_N                  0x00000800
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_11_N_BITN                     11
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_11_N_M                0x00000800
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_11_N_S                        11

// Field:    [10] WEPROT_SEC_10_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_10_N                  0x00000400
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_10_N_BITN                     10
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_10_N_M                0x00000400
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_10_N_S                        10

// Field:     [9] WEPROT_SEC_9_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_9_N                   0x00000200
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_9_N_BITN                       9
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_9_N_M                 0x00000200
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_9_N_S                          9

// Field:     [8] WEPROT_SEC_8_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_8_N                   0x00000100
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_8_N_BITN                       8
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_8_N_M                 0x00000100
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_8_N_S                          8

// Field:     [7] WEPROT_SEC_7_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_7_N                   0x00000080
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_7_N_BITN                       7
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_7_N_M                 0x00000080
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_7_N_S                          7

// Field:     [6] WEPROT_SEC_6_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_6_N                   0x00000040
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_6_N_BITN                       6
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_6_N_M                 0x00000040
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_6_N_S                          6

