espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_ccfg.h
// Field:     [5] WEPROT_SEC_5_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_5_N                   0x00000020
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_5_N_BITN                       5
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_5_N_M                 0x00000020
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_5_N_S                          5

// Field:     [4] WEPROT_SEC_4_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_4_N                   0x00000010
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_4_N_BITN                       4
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_4_N_M                 0x00000010
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_4_N_S                          4

// Field:     [3] WEPROT_SEC_3_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_3_N                   0x00000008
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_3_N_BITN                       3
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_3_N_M                 0x00000008
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_3_N_S                          3

// Field:     [2] WEPROT_SEC_2_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_2_N                   0x00000004
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_2_N_BITN                       2
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_2_N_M                 0x00000004
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_2_N_S                          2

// Field:     [1] WEPROT_SEC_1_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_1_N                   0x00000002
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_1_N_BITN                       1
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_1_N_M                 0x00000002
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_1_N_S                          1

// Field:     [0] WEPROT_SEC_0_N
//
// 0: Sector protected
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_0_N                   0x00000001
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_0_N_BITN                       0
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_0_N_M                 0x00000001
#define CCFG_CCFG_WEPROT_31_0_BY2K_WEPROT_SEC_0_N_S                          0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_WEPROT_SPARE_1
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CCFG_O_CCFG_WEPROT_SPARE_2
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CCFG_O_CCFG_WEPROT_SPARE_3
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CCFG_O_TRUSTZONE_FLASH_CFG
//
//*****************************************************************************
// Field: [16:10] NSADDR_BOUNDARY
//
// Value will be written to PRCM:NVMNSADDR.BOUNDARY by ROM boot FW only if
// CCFG_TI_OPTIONS.IDAU_CFG_ENABLE != 0xC5.
#define CCFG_TRUSTZONE_FLASH_CFG_NSADDR_BOUNDARY_W                           7
#define CCFG_TRUSTZONE_FLASH_CFG_NSADDR_BOUNDARY_M                  0x0001FC00
#define CCFG_TRUSTZONE_FLASH_CFG_NSADDR_BOUNDARY_S                          10

// Field:   [9:0] NSCADDR_BOUNDARY
//
// Value will be written to PRCM:NVMNSCADDR.BOUNDARY by ROM boot FW only if
// CCFG_TI_OPTIONS.IDAU_CFG_ENABLE != 0xC5.
#define CCFG_TRUSTZONE_FLASH_CFG_NSCADDR_BOUNDARY_W                         10
#define CCFG_TRUSTZONE_FLASH_CFG_NSCADDR_BOUNDARY_M                 0x000003FF
#define CCFG_TRUSTZONE_FLASH_CFG_NSCADDR_BOUNDARY_S                          0

//*****************************************************************************
//
// Register: CCFG_O_TRUSTZONE_SRAM_CFG
//
//*****************************************************************************
// Field:  [17:9] NSADDR_BOUNDARY
//
// Value will be written to PRCM:SRAMNSADDR.BOUNDARY by ROM boot FW only if
// CCFG_TI_OPTIONS.IDAU_CFG_ENABLE != 0xC5.
#define CCFG_TRUSTZONE_SRAM_CFG_NSADDR_BOUNDARY_W                            9
#define CCFG_TRUSTZONE_SRAM_CFG_NSADDR_BOUNDARY_M                   0x0003FE00
#define CCFG_TRUSTZONE_SRAM_CFG_NSADDR_BOUNDARY_S                            9

// Field:   [8:0] NSCADDR_BOUNDARY
//
// Value will be written to PRCM:SRAMNSCADDR.BOUNDARY by ROM boot FW only if
// CCFG_TI_OPTIONS.IDAU_CFG_ENABLE != 0xC5.
#define CCFG_TRUSTZONE_SRAM_CFG_NSCADDR_BOUNDARY_W                           9
#define CCFG_TRUSTZONE_SRAM_CFG_NSCADDR_BOUNDARY_M                  0x000001FF
#define CCFG_TRUSTZONE_SRAM_CFG_NSCADDR_BOUNDARY_S                           0

//*****************************************************************************
//
// Register: CCFG_O_SRAM_CFG
//
//*****************************************************************************
// Field:  [31:8] MEM_SEL
//
// Value will be written to SRAM_MMR:MEM_CTL.MEM_SEL by ROM boot FW
#define CCFG_SRAM_CFG_MEM_SEL_W                                             24
#define CCFG_SRAM_CFG_MEM_SEL_M                                     0xFFFFFF00
#define CCFG_SRAM_CFG_MEM_SEL_S                                              8

// Field:     [0] PARITY_DIS
//
// Value will be inverted and then written to PRCM:MCUSRAMCFG.PARITY_EN by ROM
// boot FW
#define CCFG_SRAM_CFG_PARITY_DIS                                    0x00000001
#define CCFG_SRAM_CFG_PARITY_DIS_BITN                                        0
#define CCFG_SRAM_CFG_PARITY_DIS_M                                  0x00000001
#define CCFG_SRAM_CFG_PARITY_DIS_S                                           0

//*****************************************************************************
//
// Register: CCFG_O_CPU_LOCK_CFG
//
//*****************************************************************************
// Field:     [4] LOCKNSVTOR_N
//
// Value will be inverted and written to PRCM:CPULOCK.LOCKNSVTOR by ROM boot FW
#define CCFG_CPU_LOCK_CFG_LOCKNSVTOR_N                              0x00000010
#define CCFG_CPU_LOCK_CFG_LOCKNSVTOR_N_BITN                                  4
#define CCFG_CPU_LOCK_CFG_LOCKNSVTOR_N_M                            0x00000010
#define CCFG_CPU_LOCK_CFG_LOCKNSVTOR_N_S                                     4

// Field:     [3] LOCKSVTAIRCR_N
//
// Value will be inverted and written to PRCM:CPULOCK.LOCKSVTAIRCR by ROM boot
// FW
#define CCFG_CPU_LOCK_CFG_LOCKSVTAIRCR_N                            0x00000008
#define CCFG_CPU_LOCK_CFG_LOCKSVTAIRCR_N_BITN                                3
#define CCFG_CPU_LOCK_CFG_LOCKSVTAIRCR_N_M                          0x00000008
#define CCFG_CPU_LOCK_CFG_LOCKSVTAIRCR_N_S                                   3

// Field:     [2] LOCKSAU_N
//
// Value will be inverted and written to PRCM:CPULOCK.LOCKSAU by ROM boot FW
#define CCFG_CPU_LOCK_CFG_LOCKSAU_N                                 0x00000004
#define CCFG_CPU_LOCK_CFG_LOCKSAU_N_BITN                                     2
#define CCFG_CPU_LOCK_CFG_LOCKSAU_N_M                               0x00000004
#define CCFG_CPU_LOCK_CFG_LOCKSAU_N_S                                        2

// Field:     [1] LOCKNSMPU_N
//
// Value will be inverted and written to PRCM:CPULOCK.LOCKNSMPU by ROM boot FW
#define CCFG_CPU_LOCK_CFG_LOCKNSMPU_N                               0x00000002
#define CCFG_CPU_LOCK_CFG_LOCKNSMPU_N_BITN                                   1
#define CCFG_CPU_LOCK_CFG_LOCKNSMPU_N_M                             0x00000002
#define CCFG_CPU_LOCK_CFG_LOCKNSMPU_N_S                                      1

// Field:     [0] LOCKSMPU_N
//
// Value will be inverted and written to PRCM:CPULOCK.LOCKSMPU by ROM boot FW
#define CCFG_CPU_LOCK_CFG_LOCKSMPU_N                                0x00000001
#define CCFG_CPU_LOCK_CFG_LOCKSMPU_N_BITN                                    0
#define CCFG_CPU_LOCK_CFG_LOCKSMPU_N_M                              0x00000001
#define CCFG_CPU_LOCK_CFG_LOCKSMPU_N_S                                       0

//*****************************************************************************
//
// Register: CCFG_O_DEB_AUTH_CFG
//
//*****************************************************************************
// Field:     [3] INTSPNIDEN
//
// Value will be written to CPU_DCB:DAUTHCTRL.INTSPNIDEN by ROM boot FW
#define CCFG_DEB_AUTH_CFG_INTSPNIDEN                                0x00000008
#define CCFG_DEB_AUTH_CFG_INTSPNIDEN_BITN                                    3
#define CCFG_DEB_AUTH_CFG_INTSPNIDEN_M                              0x00000008
#define CCFG_DEB_AUTH_CFG_INTSPNIDEN_S                                       3

// Field:     [2] SPNIDENSEL
//
// Value will be written to CPU_DCB:DAUTHCTRL.SPNIDENSEL by ROM boot FW
#define CCFG_DEB_AUTH_CFG_SPNIDENSEL                                0x00000004
#define CCFG_DEB_AUTH_CFG_SPNIDENSEL_BITN                                    2
#define CCFG_DEB_AUTH_CFG_SPNIDENSEL_M                              0x00000004
#define CCFG_DEB_AUTH_CFG_SPNIDENSEL_S                                       2

// Field:     [1] INTSPIDEN
//
// Value will be written to CPU_DCB:DAUTHCTRL.INTSPIDEN by ROM boot FW
#define CCFG_DEB_AUTH_CFG_INTSPIDEN                                 0x00000002
#define CCFG_DEB_AUTH_CFG_INTSPIDEN_BITN                                     1
#define CCFG_DEB_AUTH_CFG_INTSPIDEN_M                               0x00000002
#define CCFG_DEB_AUTH_CFG_INTSPIDEN_S                                        1

// Field:     [0] SPIDENSEL
//
// Value will be written to CPU_DCB:DAUTHCTRL.SPIDENSEL by ROM boot FW
#define CCFG_DEB_AUTH_CFG_SPIDENSEL                                 0x00000001
#define CCFG_DEB_AUTH_CFG_SPIDENSEL_BITN                                     0
#define CCFG_DEB_AUTH_CFG_SPIDENSEL_M                               0x00000001
#define CCFG_DEB_AUTH_CFG_SPIDENSEL_S                                        0


#endif // __CCFG__
